{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Qwen2ForCausalLM",
    "parent_library": "transformers.models.qwen2.modeling_qwen2",
    "unsloth_fixed": true
  },
  "base_model_name_or_path": "unsloth/qwen2.5-3b-instruct-unsloth-bnb-4bit",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "down_proj",
    "q_proj",
    "up_proj",
    "v_proj",
    "k_proj",
    "gate_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}